hotchk155/noodlebox_firmware/NoodleBox/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief
 * NMI Pin Enable: PTB4/KBI0_P12/FTM2_CH4/SPI0_MISO/ACMP1_IN2/NMI pin functions as PTB4, KBI0_P12, FTM2_CH4,
 * SPI0_MISO or ACMP1_IN2.
 */
#define SOPT0_NMIE_0b0 0x00u
/*!
 * @brief UART0 RxD Filter Select: RXD0 input signal is connected to UART0 module directly. */
#define SOPT0_RXDFE_0b00 0x00u

/*! @name PORTA6 (number 38), GATEOUT4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_GATEOUT4_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_GATEOUT4_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_GATEOUT4_GPIO_PORT kGPIO_PORTA    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_GATEOUT4_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_GATEOUT4_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_GATEOUT4_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_GATEOUT4_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORTB2 (number 32), P_ASCK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_P_ASCK_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_P_ASCK_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_P_ASCK_GPIO_PORT kGPIO_PORTB    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_P_ASCK_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_P_ASCK_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_P_ASCK_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_P_ASCK_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTB3 (number 31), P_ADAT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_P_ADAT_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_P_ADAT_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_P_ADAT_GPIO_PORT kGPIO_PORTB    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_P_ADAT_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_P_ADAT_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_P_ADAT_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_P_ADAT_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTB5 (number 18), LED1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_LED1_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_LED1_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_LED1_GPIO_PORT kGPIO_PORTB    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_LED1_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_LED1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_LED1_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_LED1_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTC0 (number 26), P_ARCK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_P_ARCK_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_P_ARCK_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_P_ARCK_GPIO_PORT kGPIO_PORTC    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_P_ARCK_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_P_ARCK_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_P_ARCK_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_P_ARCK_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTC1 (number 25), P_KDAT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_P_KCLK_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_P_KCLK_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_P_KCLK_GPIO_PORT kGPIO_PORTC    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_P_KCLK_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_P_KCLK_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_P_KCLK_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_P_KCLK_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                               /* @} */

