hotchk155/noodlebox_firmware/NoodleBox/board/pin_mux.h
/*! @name PORTC2 (number 21), LED3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_LED3_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_LED3_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_LED3_GPIO_PORT kGPIO_PORTC    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_LED3_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_LED3_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_LED3_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_LED3_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTC3 (number 20), LED2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_LED2_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_LED2_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_LED2_GPIO_PORT kGPIO_PORTC    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_LED2_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_LED2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_LED2_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_LED2_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTC5 (number 61), SYNCOUT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_SYNCOUT_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_SYNCOUT_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_SYNCOUT_GPIO_PORT kGPIO_PORTC    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_SYNCOUT_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_SYNCOUT_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_SYNCOUT_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_SYNCOUT_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORTC6 (number 52), KEYSCAN1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_KEYSCAN1_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_KEYSCAN1_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_KEYSCAN1_GPIO_PORT kGPIO_PORTC    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_KEYSCAN1_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_KEYSCAN1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_KEYSCAN1_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_KEYSCAN1_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORTD0 (number 2), ENCODER2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_ENCODER2_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_ENCODER2_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_ENCODER2_GPIO_PORT kGPIO_PORTD    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_ENCODER2_GPIO_PIN_MASK (1U << 24U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_ENCODER2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_ENCODER2_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_ENCODER2_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORTD1 (number 1), ENCODER1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_ENCODER1_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_ENCODER1_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_ENCODER1_GPIO_PORT kGPIO_PORTD    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_ENCODER1_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_ENCODER1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_ENCODER1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_ENCODER1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORTD2 (number 46), GATEOUT1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_GATEOUT1_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_GATEOUT1_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_GATEOUT1_GPIO_PORT kGPIO_PORTD    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_GATEOUT1_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_GATEOUT1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_GATEOUT1_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_GATEOUT1_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORTD3 (number 45), GATEOUT2
  @{ */

