hotchk155/noodlebox_firmware/NoodleBox/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_GATEOUT2_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_GATEOUT2_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_GATEOUT2_GPIO_PORT kGPIO_PORTD    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_GATEOUT2_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_GATEOUT2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_GATEOUT2_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_GATEOUT2_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORTD4 (number 44), GATEOUT3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_GATEOUT3_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_GATEOUT3_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_GATEOUT3_GPIO_PORT kGPIO_PORTD    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_GATEOUT3_GPIO_PIN_MASK (1U << 28U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_GATEOUT3_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_GATEOUT3_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_GATEOUT3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORTD5 (number 24), P_KDAT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_P_KDAT_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_P_KDAT_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_P_KDAT_GPIO_PORT kGPIO_PORTD    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_P_KDAT_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_P_KDAT_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_P_KDAT_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_P_KDAT_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTA0 (number 50), EXTSYNC
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_EXTSYNC_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_EXTSYNC_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_EXTSYNC_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORTB4 (number 19), KEYSCAN2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_KEYSCAN2_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_KEYSCAN2_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_KEYSCAN2_GPIO_PORT kGPIO_PORTB    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_KEYSCAN2_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_KEYSCAN2_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_KEYSCAN2_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_KEYSCAN2_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORTE7 (number 5), OFF_SWITCH
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_OFF_SWITCH_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_OFF_SWITCH_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_OFF_SWITCH_GPIO_PORT kGPIO_PORTE    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_RELEASE_OFF_SWITCH_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_OFF_SWITCH_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_OFF_SWITCH_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_OFF_SWITCH_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORTC7 (number 51), AUXIN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_AUXIN_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_AUXIN_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_AUXIN_GPIO_PORT kGPIO_PORTC    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_AUXIN_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_AUXIN_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_AUXIN_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_AUXIN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTA7 (number 37), AUXOUT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_AUXOUT_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_AUXOUT_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_AUXOUT_GPIO_PORT kGPIO_PORTA    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_RELEASE_AUXOUT_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_AUXOUT_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_AUXOUT_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_AUXOUT_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTE2 (number 54), POWER_CTRL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RELEASE_POWER_CTRL_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_POWER_CTRL_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RELEASE_POWER_CTRL_GPIO_PORT kGPIO_PORTE    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_RELEASE_POWER_CTRL_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RELEASE_POWER_CTRL_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RELEASE_POWER_CTRL_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RELEASE_POWER_CTRL_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins_Release(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
